export const SongsData = [
  [
    {
      id: 'Love Me Do',
      name: 'The Beatles',
      description: 'Британская рок-группа из Ливерпуля, основанная в 1960 году, в составе которой играли Джон Леннон, Пол Маккартни, Джордж Харрисон и Ринго Старр. Также в разное время в составе группы выступали Стюарт Сатклифф, Пит Бест и Джимми Никол. Большинство композиций The Beatles созданы в соавторстве и подписаны именами Джона Леннона и Пола Маккартни. Дискография группы включает 13 официальных студийных альбомов, изданных в 1963-1970 годах, и 211 песен.',
      image: 'beatles.jpg',
      audio: 'Love Me Do   Beatles.mp3'
    },
    {
      id: 'Paint It Black',
      name: 'The Rolling Stones',
      description: 'Британская рок-группа, образовавшаяся 12 июля 1962 года и многие годы соперничавшая по популярности с The Beatles. The Rolling Stones, ставшие важной частью Британского вторжения, считаются одной из самых влиятельных и успешных групп в истории рока. The Rolling Stones, которые по замыслу менеджера Эндрю Луга Олдэма должны были стать «бунтарской» альтернативой The Beatles, уже в 1969 году в ходе американского турне рекламировались как «величайшая рок-н-ролльная группа в мире» и сумели сохранить этот статус по сей день.',
      image: 'rolling stones.jpg',
      audio: 'Paint It Black – The Rolling Stones.mp3'
    },
    {
      id: 'Thunderstruk',
      name: 'AC/DC',
      description: 'Австралийская рок-группа, сформированная в Сиднее в ноябре 1973 года выходцами из Шотландии, братьями Малькольмом и Ангусом Янгами. Наряду с такими группами, как Led Zeppelin, Deep Purple, Queen, Iron Maiden, Scorpions, Black Sabbath, Uriah Heep, Judas Priest и Motörhead, AC/DC часто рассматриваются как пионеры хард-рока и хеви-метала.',
      image: 'ACDC.jpg',
      audio: 'Thunderstruk ACDC .mp3'
    },
    {
      id: 'Nothing Else Matters',
      name: 'Metallica',
      description: 'Американская метал-группа, образованная в 1981 году, в Лос-Анджелесе. Metallica оказала большое влияние на развитие метала и входит в «большую четвёрку трэш-метала». Альбомы Metallica были проданы в общей сложности в количестве более 110 миллионов экземпляров по всему миру, что делает её одним из самых коммерчески успешных металлических коллективов. В 2011 году один из крупнейших журналов о метал-музыке Kerrang! в июньском номере признал Metallica лучшей метал-группой последних 30 лет.',
      image: 'Metallica.jpg',
      audio: 'Nothing Else Matters   Metallica.mp3'
    },
    {
      id: 'Comfortably Numb',
      name: 'Pink Floyd',
      description: 'Британская рок-группа, знаменитая своими продолжительными композициями и объединёнными в тематические сюиты песнями, звуковыми экспериментами, философскими текстами, дизайном обложек альбомов и грандиозными концертными шоу. Является одной из наиболее влиятельных и коммерчески успешных групп в истории мировой рок-музыки - в её активе более 250 млн проданных альбомов в мире, в том числе 75 млн - в США.',
      image: 'Pink Floyd.jpg',
      audio: 'Comfortably Numb   Pink Floyd.mp3'
    },
    {
      id: 'Supermassive Black Hole',
      name: 'Muse',
      description: 'Британская рок-группа, образованная в 1994 году в городе Тинмут. Группа состоит из трёх участников: Мэттью Беллами, Криса Уолстенхолма и Доминика Ховарда.',
      image: 'Muse.jpg',
      audio: 'Supermassive Black Hole   Muse.mp3'
    }
  ],
  [
    {
      id: 'Can\'t Stop Feeling',
      name: 'Franz Ferdinand',
      description: 'Британская инди-рок-группа, образованная в 2002 году в Глазго. В состав группы изначально входили Алекс Капранос, Ник Маккарти, Боб Харди, Пол Томсон, но затем Маккарти в 2016 году временно покинул группу и он был заменён на Дино Бардота и Джулиана Корри. Группа известна как одна из самых популярных постпанк-ривайвл групп, попавших в топ-20 хитов Великобритании и продавших более 3 млн копий студийных альбомов. Они были номинированы на несколько «Грэмми» и получили две Brit Awards и NME Awards.',
      image: 'Franz Ferdinand.jpg',
      audio: 'Can t Stop Feeling   Franz Ferdinand.mp3'
    },
    {
      id: 'Old Yellow Bricks',
      name: 'Arctic Monkeys',
      description: 'Британская рок-группа, сформированная в 2002 году в Хай Грин, пригороде Шеффилда. В настоящий момент состоит из вокалиста и гитариста Алекса Тёрнера, гитариста Джейми Кука, барабанщика Мэтта Хелдерса и бас-гитариста Ника О’Мэлли, сменившего ранее игравшего в группе Энди Николсона, который покинул группу в 2006 году, вскоре после выхода дебютного альбома.',
      image: 'Arctic Monkeys.jpg',
      audio: 'Old Yellow Bricks – Arctic Monkeys.mp3'
    },
    {
      id: 'Seven Nation Army',
      name: 'The White Stripes',
      description: 'Американская рок-группа, образованная в 1997 году в Детройте, штат Мичиган. В состав The White Stripes с самого начала входили лишь два человека: Джек Уайт - гитарист, пианист и вокалист, и Мег Уайт - барабанщица-перкуссионистка, иногда исполняющая бэк-вокал. Изредка в песнях группы используются такие инструменты, как калимба, губная гармошка и банджо.',
      image: 'The White Stripes.jpg',
      audio: 'Seven Nation Army   The White Stripes.mp3'
    },
    {
      id: 'Naive',
      name: 'The Kooks',
      description: 'Британская инди-рок-группа, основанная в Брайтоне, Англия, в 2004 году. Состав участников в настоящее время: Люк Причард, Хью Харрис, Алексис Нуньес и Пит Дентон. The Kooks выпустили четыре студийных альбома, первые два достигли большого успеха в британских чартах: в 2006 году дебютный альбом Inside in/Inside out достиг 2 строчки, второй альбом Konk сразу после выхода занял 1 место. В своём первом совместном концерте участники квартета исполнили кавер композиции Reptilia команды The Strokes. С тех пор они прошли довольно долгий путь, стали любимцами музыкальной прессы и записали в свой актив впечатляющие выступления на разогреве у The Thrills,The Subways и The Rolling Stones.',
      image: 'The Kooks.jpg',
      audio: 'Naive   The Kooks.mp3'
    },
    {
      id: 'Club Foot',
      name: 'Kasabian',
      description: 'Британская рок-группа, образованная в 1997 году в Лестере. Первоначально в состав группы входили вокалист Том Мейган, гитарист и вокалист Серджио Пиццорно, гитарист Крис Карлофф и басист Крис Эдвардс. После работы группы с несколькими сессионными барабанщиками в 2004 году к Kasabian присоединился барабанщик Иэн Мэтьюз. В 2006 году Карлофф покинул коллектив и основал новую группу под названием Black Onassis. В 2006 году состав группы пополнил Джей Мелер. В 2013 году Мелер ушёл из Kasabian в группу Лиама Галлахера Beady Eye и был заменён Тимом Картером...',
      image: 'Kasabian.jpg',
      audio: 'Club Foot – Kasabian.mp3'
    },
    {
      id: 'Thunder',
      name: 'Imagine Dragons',
      description: 'Американская инди-рок-группа, образованная в 2008 году в городе Лас-Вегас, США. Стали известны после выпуска дебютного студийного альбома Night Visions в сентябре 2012 года. Американский журнал Billboard назвал их самыми яркими новыми звёздами 2013 года и самой большой группой 2017 года, а журнал Rolling Stone назвал их сингл «Radioactive» самым большим рок-хитом года.',
      image: 'Imagine Dragons.jpg',
      audio: 'Thunder   Imagine Dragons.mp3'
    }
  ],
  [
    {
      id: 'Toxicity',
      name: 'System of A Down',
      description: 'Армяно-американская рок-группа, образованная в 1992 году в Лос-Анджелесе Сержем Танкяном и Дароном Малакяном под названием Soil, а в 1995 принявшая нынешнее название. Все участники группы имеют армянское происхождение. В период с 1998 по 2005 год группа выпустила пять студийных альбомов, каждый из которых стал платиновым. Было продано более 40 миллионов копий альбомов по всему миру. В 2006 году участники System of a Down решили временно приостановить совместную деятельность и заняться сольными проектами. 29 ноября 2010 года группа объявила о воссоединении и проведении европейского турне в 2011 году. Изначально группа должна была называться «Victims of the Down» - по стихотворению, написанному Дароном Малакяном...',
      image: 'System of A Down.jpg',
      audio: 'Toxicity – System Of A Down.mp3'
    },
    {
      id: 'Wake Up',
      name: 'Rage Against The Machine',
      description: 'Американская рок-группа, существующая с 1991. В их музыке сочетаются и элементы тяжёлого рока и хип-хопа, но более всего группа известна своими крайне левыми политическими взглядами. Их тексты и общественные заявления содержали резкую критику американского империализма, капитализма, глобализации, войн, а также поддержку таких деятелей, как Мумия Абу-Джамал, Леонард Пелтиер и Абимаэль Гусман. На своих выступлениях группа неоднократно сжигала американский флаг.',
      image: 'Rage Against The Machine.jpg',
      audio: 'Wake Up   Rage Against The Machine.mp3'
    },
    {
      id: 'Song 2',
      name: 'Blur',
      description: 'Британская рок-группа, основанная в 1988 году в Лондоне. Одна из самых успешных групп 90-х. В состав группы входят Деймон Албарн, Грэм Коксон, Алекс Джеймс и Дейв Раунтри. Дебютный альбом группы, Leisure, комбинирует влияния мэдчестера и шугейзинга. Последовавшие стилистические изменения 1992 года - под влиянием английских гитарных групп, таких как The Kinks, The Beatles и XTC - привели к появлению на свет альбомов Modern Life Is Rubbish, Parklife и The Great Escape. В результате группа стала главным популяризатором брит-попа и получила широкую известность на территории Великобритании, при поддержке, не в последнюю очередь, популярной битвы в чартах, окрещённой «Битва брит-попа», с соперничающей группой Oasis..',
      image: 'Blur.jpg',
      audio: 'Song 2   Blur.mp3'
    },
    {
      id: 'Street Spirit',
      name: 'Radiohead',
      description: 'Британская рок-группа из Оксфордшира. Группа была основана в 1985 году, и её состав с того времени не менялся. Стиль Radiohead традиционно определяют как альтернативный рок, хотя на разных этапах звучание варьировалось от брит-попа до арт-рока и электронной музыки.',
      image: 'Radiohead.jpg',
      audio: 'Street Spirit   Radiohead.mp3'
    },
    {
      id: 'Californication',
      name: 'Red Hot Chili Peppers',
      description: 'Американская рок-группа, образованная в 1983 году в Калифорнии вокалистом Энтони Кидисом, басистом Майклом Бэлзари, гитаристом Хиллелом Словаком и барабанщиком Джеком Айронсом. Обладает 7 премиями «Грэмми». Во всём мире проданы более 80 миллионов копий их альбомов. По версии VH1 «100 Greatest Artists of Hard Rock» заняли 30-е место. 14 апреля 2012 года группа была включена в Зал славы рок-н-ролла. Группа заняла третье место в символическом списке «Лучшие исполнители за 10 лет скробблинга» портала Last.fm.',
      image: 'Red Hot Chili Peppers.jpg',
      audio: 'Californication   Red Hot Chili Peppers.mp3'
    },
    {
      id: 'In The End',
      name: 'Linkin Park',
      description: 'Американская рок-группа, основанная в 1996 году под названием Xero и исполняющая музыку преимущественно в стилях альтернативный метал, ню-метал и рэп-метал, альтернативный рок, электроник-рок, поп и поп-рок. Существуя с 2000 года под названием Linkin Park, группа была шесть раз номинирована и два раза удостоилась награды «Грэмми». Группа обрела успех благодаря дебютному альбому 2000 года под названием Hybrid Theory, проданному тиражом более чем в 30 миллионов экземпляров. Следующий студийный альбом, Meteora, повторил, хоть и не превзошёл успеха предыдущего, лидируя в 2003 году в чарте Billboard 200. В общей сложности группа выпустила семь студийных альбомов, которые разошлись общим тиражом около 100 миллионов экземпляров.',
      image: 'Linkin Park.png',
      audio: 'In The End   Linkin Park.mp3'
    }
  ],
  [
    {
      id: 0,
      name: 'Guns\'N Roses',
      description: 'Американская хард-рок-группа, сформировавшаяся в 1985 году в Лос-Анджелесе, штат Калифорния. В первоначальный состав участников, которые в 1986 году заключили контракт со звукозаписывающей компанией Geffen Records, входили: вокалист Эксл Роуз, соло-гитарист Слэш, ритм-гитарист Иззи Стрэдлин, басист Дафф Маккаган и барабанщик Стивен Адлер. За время своего существования коллектив Guns N’ Roses претерпел несколько изменений в составе. Текущий состав включает: Роуза, Слэша, Маккагана, а также клавишников Диззи Рида и Мелиссу Риз, гитариста Ричарда Фортуса и барабанщика Фрэнка Феррера...',
      image: 'Guns N Roses.jpg',
      audio: 'Don\'t Cry – Guns N\' Roses.mp3'
    },
    {
      id: 'Kashmir',
      name: 'Led Zeppelin',
      description: 'Британская рок-группа, образовавшаяся в сентябре 1968 года в Лондоне, и признанная одной из самых успешных, новаторских и влиятельных в современной истории. Создав собственное звучание, Led Zeppelin стали одной из ведущих групп хард-рока, сыграли основополагающую роль в становлении хеви-метала, свободно интерпретируя фолк- и блюз-классику и обогащая стиль элементами других музыкальных жанров. Отказавшись от выпуска синглов, группа заложила основу понятия «альбомный рок».',
      image: 'Led Zeppelin.jpg',
      audio: 'Led Zeppelin – Kashmir.mp3'
    },
    {
      id: 'Smoke on the Water',
      name: 'Deep Purple',
      description: 'Британская рок-группа, образованная в феврале 1968 года в Хартфорде, Англия, и считающаяся одной из самых заметных и влиятельных в хард-роке 1970-х годов. Музыкальные критики считают Deep Purple одними из основателей хард-рока и высоко оценивают их вклад в его развитие. Музыканты «классического» состава Deep Purple считаются инструменталистами-виртуозами. В мире продано более 100 миллионов копий их альбомов. В 2016 году группа была введена в Зал славы рок-н-ролла.',
      image: 'Deep Purple.jpg',
      audio: 'Smoke on the Water   Deep Purple.mp3'
    },
    {
      id: 'Wind Of Change',
      name: 'Scorpions',
      description: 'Немецкая англоязычная рок-группа, созданная в 1965 в Ганновере. Для стиля группы характерны как классический хард-рок, так и лирические гитарные баллады. Scorpions являются самой популярной рок-группой Германии и одной из самых известных в мире, продав более 100 миллионов копий своих альбомов.',
      image: 'Scorpions.jpg',
      audio: 'Wind Of Change   Scorpions.mp3'
    },
    {
      id: 'Walk This Way',
      name: 'Aerosmith',
      description: 'Музыкальная группа, вероятно, самый важный представитель американского хард-рока. Группа черпала своё вдохновение в британском блюз-роке, доминировавшем на рок-сцене в конце 1960-х и начале 1970-х, как, например, Cream, Led Zeppelin, Jeff Beck Group, а также the Rolling Stones.',
      image: 'Aerosmith.jpg',
      audio: 'Walk This Way   Aerosmith.mp3'
    },
    {
      id: 'No One Knows',
      name: 'Queens of the Stone Age',
      description: 'Американская рок-группа из Калифорнии, основанная в 1996 году Джошем Хомми. Группа играет комбинированный вариант метала и психоделического рока, являясь, таким образом, одним из наиболее известных представителей стоунера.',
      image: 'Queens of the Stone Age.jpg',
      audio: 'Queens Of The Stone Age – No One Knows.mp3'
    }
  ],
  [
    {
      id: 'Gold On The Ceiling',
      name: 'The Black Keys',
      description: 'Американская рок-группа, сформированная в 2001 году в городе Акрон. Играет музыку в жанрах блюз-рок, гаражный рок и инди-рок. На протяжении всего своего существования группа состоит из двух человек: Дэна Ауэрбаха и Патрика Карни. По состоянию на октябрь 2011 года, группа продала более 2 миллионов копий альбомов в Соединенных Штатах.',
      image: 'The Black Keys.jpg',
      audio: 'The Black Keys – Gold On The Ceiling.mp3'
    },
    {
      id: 'Smells Like Teen Spirit',
      name: 'Nirvana',
      description: 'Американская рок-группа, созданная вокалистом и гитаристом Куртом Кобейном и басистом Кристом Новоселичем в Абердине, штат Вашингтон, в 1987 году. В составе коллектива сменились несколько барабанщиков; дольше всех с группой играл ударник Дэйв Грол, присоединившийся к Кобейну и Новоселичу в 1990 году.',
      image: 'Nirvana.jpg',
      audio: 'Smells Like Teen Spirit   Nirvana.mp3'
    },
    {
      id: 'Anna Molly',
      name: 'Incubus',
      description: 'Американская альтернативная рок-группа. Группа была создана в калифорнийском городе Калабасасе в 1992 году одноклассниками Брэндоном Бойдом (вокал, перкуссия), Майком Айнзайгером (гитара), Алексом Катуничем, взявшим себе псевдоним «Дирк Лэнс» (бас-гитара), и Хосе Пасийясом (ударные).',
      image: 'Incubus.jpg',
      audio: 'Anna Molly   Incubus.mp3'
    },
    {
      id: 'Shocking You',
      name: 'Shocking Blue',
      description: 'Голландская рок-группа из Гааги, существовавшая с 1967 по 1974 год. Известнейшая песня группы «Venus» в феврале 1970 года заняла первое место в чарте Billboard Hot 100.',
      image: 'Shocking Blue.jpg',
      audio: 'Shocking Blue – Shocking You.mp3'
    },
    {
      id: 'Kryptonite',
      name: '3 Doors Down',
      description: 'Американская рок-группа, основанная в Эскатаупе в 1996 году Брэдом Арнольдом, Мэттом Робертсом и Тоддом Харреллом. После успеха песни «Kryptonite» группа подписала контракт с Universal Records. Их альбомы разошлись тиражом свыше 20 миллионов копий в мире после их дебютного альбома «The Better Life», выпущенного в 2000 году.',
      image: '3 Doors Down.jpg',
      audio: 'Kryptonite   3 Doors Down.mp3'
    },
    {
      id: 'Clint Eastwood',
      name: 'Gorillaz',
      description: 'Британская виртуальная группа, созданная в 1998 году Деймоном Албарном и Джейми Хьюлеттом. Проект включает в себя обширную вымышленную вселенную, окружающую саму «виртуальную группу», состоящую из четырёх анимационных участников: 2-D, Мёрдока Никкалса, Нудл и Рассела Хоббса.',
      image: 'Gorillaz.jpg',
      audio: 'Clint Eastwood   Gorillaz.mp3'
    }
  ],
  [
    {
      id: 'American Idiot',
      name: 'Green Day',
      description: 'Американская панк-рок группа, основанная в 1986 году. Состоит из трёх участников: Билли Джо Армстронга, Майка Дёрнта и Тре Кула. Green Day первоначально были частью панк-рок среды, сформировавшейся вокруг панк-клуба 924 Gilman Street.',
      image: 'Green Day.jpg',
      audio: 'American Idiot   Green Day.mp3'
    },
    {
      id: 'Pretty Fly',
      name: 'The Offspring',
      description: 'Американская калифорнийская панк-рок-группа, основанная в 1984 году. В настоящее время в её состав входят вокалист и гитарист Декстер Холланд, гитарист Кевин Вассерман, ударник Пит Парада, а с 2009 года с ними гастролирует гитарист из группы H₂O Тодд Морс. В течение долгого времени на ударных в группе играл Рон Уэлти. С самого создания The Offspring и до недавнего времени в группе участвовал бас-гитарист Грег Крисел. Копии альбомов The Offspring проданы количеством в 40 миллионов по всему миру, и считается одной из самых продаваемых панк-рок групп за всё время.',
      image: 'The Offspring.jpg',
      audio: 'Pretty Fly   The Offspring.mp3'
    },
    {
      id: 'Fat Lip',
      name: 'Sum 41',
      description: 'Канадская панк-рок-группа из города Эйджакс, Онтарио. Была образована в 1996 году, текущий состав группы: Дерик Уибли, Джейсон МакКэслин, Том Такер, Дэйв Бэкш и Фрэнк Зуммо.',
      image: 'Sum 41.jpg',
      audio: 'Fat Lip   Sum 41.mp3'
    },
    {
      id: 'Dance, Dance',
      name: 'Fall Out Boy',
      description: 'Американская рок-группа, основанная в 2001 году в городе Уилметт, Иллинойс. Группа состоит из Патрика Стампа, Пита Вентца, Джо Тромана, Эндрю Хёрли. Основателями коллектива считаются Джозеф Троман и Пит Вентц.',
      image: 'Fall Out Boy.jpg',
      audio: 'Dance, Dance – Fall Out Boy.mp3'
    },
    {
      id: 'Playmate of the Year',
      name: 'Zebrahead',
      description: 'Американская рок-группа из округа Ориндж, Калифорния, совмещающая в своём творчестве такие стили как поп-панк, панк-рок и рэп-рок. Группа была сформирована в 1996 году. Состав на момент сформирования: Justin Mauriello, Greg Bergdorf, Ben Osmundson и Ed Udhus.',
      image: 'Zebrahead.jpg',
      audio: 'Playmate of the Year   zebrahead.mp3'
    },
    {
      id: 'All The Small Things',
      name: 'blink-182',
      description: 'Американская панк-рок-группа, основанная в 1992 году гитаристом и вокалистом Томом Делонгом, бас-гитаристом и вокалистом Марком Хоппусом и барабанщиком Скоттом Рэйнором в северном пригороде Сан-Диего, городе Пауэй, Калифорния',
      image: 'blink-182.jpg',
      audio: 'All The Small Things   blink-182.mp3'
    }
  ]
]

export const SongsClass = [
  'Разминка', 'Инди-рок', 'Микс 1',
  'Хард-рок', 'Микс 2', 'Панк-рок']
